0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0544766;

boundaryField
{


   left
    {
        type           symmetryPlane;
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform 0.0544766;
        value           uniform 0.0544766;
    }

    topAndBottom
    {
        type            nuSgsUSpaldingWallFunction;
        value           uniform 0.0544766;
    }

    capsuleWall
    {
        type            nuSgsUSpaldingWallFunction;
        value           uniform 0.0544766;
    }
        
    frontAndBack
    {
        type           empty;
    }
}

// ************************************************************************* //
